[
{
 "title":"Hetero Drugs Limited Hiring M.Sc,B.tech,M.Tech for Analytical R&D professional", 
"desc":"Hetero Drugs Limited  is inviting eligible candidates to apply online for the position of Analytical R&D professional in Biologics / Bio-Similars / Biopharma.. Candidates can  find their eligibility from below details .Eligible and interested candidates can apply from the source may provided at the bottom of this article. This content to be used only for informational purpose and not responsible for the inaccuracy or deficiency of the provided information.

Qualification: B.Tech/B.E. – Bio-Chemistry/Bio-Technology,M.Tech – Bio-Chemistry/Bio-Technology, Biomedical – MS/M.Sc(Science) – Organic Chemistry

Experience required: 4 – 9 Years 

Post Name:   Analytical R&D professional in Biologics / Bio-Similars / Biopharma.",
 "url":"http://careers.heterodrugs.com/job-listings-Analytical-R-D-Biologics-bio-similars-biopharma-Hetero-Drugs-Limited-Hyderabad-Secunderabad-4-to-9-years-210319002080?xp=1"
},
{
"title":"Biocon Hiring M.Sc for Senior Scientist", 
"desc":"Biocon is a subsidiary of Biocon Ltd, an innovation led global biopharmaceuticals company and India’s ﬁrst publicly listed biotech enterprise. … The company aspires to transform patient lives through innovative and inclusive healthcare solutions.
 Biocon Hiring M.Sc for Senior Scientist SWARNALATHA B September 19, 2020
Biocon Recruitment September 2020. Biocon is a subsidiary of Biocon Ltd, an innovation led global biopharmaceuticals company and India’s ﬁrst publicly listed biotech enterprise. … The company aspires to transform patient lives through innovative and inclusive healthcare solutions.

Important Vacancy details:

Post Name: Senior Scientist
Education:  M.Sc
Experienced:02 to 5 years
Location: India
 ",
"url":"https://career10.successfactors.com/career?career_ns=job_listing&company=bioconlimi&navBarLevel=JOB_SEARCH&rcm_site_locale=en_US&career_job_req_id=1654&selected_lang=en_US&jobAlertController_jobAlertId=&jobAlertController_jobAlertName=&_s.crb=Po51bf7zSbD1YHK9103KIuggUQ%2BznogfVGwjjye2c1M%3D&fbclid=IwAR0ExOISsMOzwm36mmr-sQnuwXUukIkHbGWbIC9JEN4V90mmsmXLKYlrtpI"
},
{
"title":"Rainbow Medinova Diagnostic Services Hiring B.sc,M.sc for Microbiologist & Microbiology Technicians", 
"desc":"Rainbow Medinova Diagnostic Centre – Service Provider of health check up centers, sonography centers & blood testing services in Nagpur, Maharashtra.

Important Vacancy details:

Post Name: Microbiologist & Microbiology Technicians
Qualification: B.sc,M.sc
Experienced:1 years
Location:Ramdas Peth, Nagpur, Maharashtra
 Contact:9405906982/9028940280",
"url":"https://pharmajobalert.in/rainbow-medinova-diagnostic-services-hiring-b-scm-sc-for/"
},
{
"title":"Accurex Biomedical Hiring B.sc,M.sc,B.tech,MBA,Bachelor’s degree for Sales/B2B/Marketing/Regulatory/Production", 
"desc":"Accurex Biomedical Pvt. Ltd Recruitment September 2020. Established in 1984, Accurex Biomedical Pvt. Ltd. is one of the top 3 manufacturers of quality Clinical Chemistry Reagents and Urinanalysis Test Strips with over 35 years of expertise in this area. Our company name is composed of two words, ACCU and REX. ‘ACCU’ refers to the word ‘accurate’. Its definition as described by Oxford dictionary portrays the essence of our existence. ‘REX’, a Latin word for ‘king’, speaks of our authoritative influence in the diagnostic industry
Important Vacancy details:
Post Name: Sales/B2B/Marketing/Regulatory/Production
Education:B.Sc /DMLT/MBA and / BE/M.sc/Bachelor’s degree
Experienced:1 to 5 years
Location: Asansol, Mumbai, Chennai, Jaipur, Baroda, Indore,Boisar
",
"url":"https://accurex.net/careers-2/?fbclid=IwAR1TLJs34m00MvuJgvBSn89iwYoux23j39xyFqrvS-ptUPbpFNGqkXq-d2k"
},
{
"title":"Accenture Hiring B.sc for Clinical Data Management (CDM)", 
"desc":"Accenture Recruitment September 2020. Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries – powered by the world’s largest network of Advanced Technology and Intelligent Operations centers.
Important Vacancy details:
Post Name: Clinical Data Management (CDM)
Education: B.sc
Experienced:01 to 3 years
Location: Bengaluru
 Job Description: We have requirement for the post of Clinical Data Management (CDM) in Accenture !

You will be aligned with our Pharmaceuticals Processes vertical and help us with the processes to collect, monitor, research, assess and evaluate information on the adverse effects of medication with a view to identifying new information about hazards associated with medicines and consequently, prevent harm to patients. It also deals with the reviewing and resolving of discrepancies identified by the system or through manual checks as per guidelines. Employees under this span can also be responsible for a number of activities related to the design, development, and maintenance of Clinical Database objects.
 You will be working as a part of the Data Maintenance team which is responsible for completeness & validity of the data in the clinical database. The team reviews and resolves discrepancies identified by the system or through manual checks as per guidelines, issue data clarification forms as and when required. You will have to perform discrepancy review & perform Self-Evident Corrections per DRP (as and when required). You will also solve for discrepancy management for SAE related discrepancies.

The Clinical Data Management focuses on the collection, integration and the availability of data at appropriate quality and cost. The team is responsible for performing data management activities including discrepancy review, query generation and resolution. The team is also responsible for creating CRF Completion Guidelines (CCG) and SAE reconciliation guidelines. The role may require you to identify and raise protocol deviations in the database, perform edit check validation by creating test cases, write test scripts and carry-out database validation (UAT) against the specified CRF/ECRF. The role may also need expertise in managing clinical data management projects.

Good to have skills: Data Management,Good communication skills",
"url":"https://www.accenture.com/in-en/careers/jobdetails?id=46968_india_2&title=12-Data%20Maintenance&fbclid=IwAR1DWuP-xwjiNLUTDBP8DIUKIwh6bSESKIRfJPsJzo8w5TvIx-NmvJAz6m0"
},
{
"title":"Cliantha Research Hiring B.Pharm,M.Pharm,M.Sc for Bioanalytical-Officer / Sr. Officer/ Executive / Sr. Executive", 
"desc":"Cliantha Research Limited Recruitment September 2020. Cliantha Research, a full-service Clinical Research Organization (CRO), is a leading provider of Clinical research services, based in Ahmedabad, India. Cliantha’s motto is Science with Integrity.
Important Vacancy details:
Post Name: Bioanalytical-Officer / Sr. Officer/ Executive / Sr. Executive
Education:B.Pharm / M.Pharm / M.Sc
Experienced:01 to 4 years
Location: Ahmedabad
Note:If interested candidates can share your resume to mentioned mail ID Below.
dmirchandani@cliantha.com & azode@cliantha.com
Job Description: We have requirement for the post of Bioanalytical-Officer / Sr. Officer/ Executive / Sr. Executive in Cliantha Research Limited !
Centrifuges, evaporators, freeze specimens as required.
• Performs aliquots of samples for wet chemistry.
• Performs wet chemistry according to study protocol guidelines and/or SOPs.
• Completes QC sheets and makes log book entries as required by protocol and/or SOP.
• Operate HPLC, LC/MS/MS and ICP-OES; troubleshoots problems and performs minor
repairs.
• Prepares required reagents and solvents.
• Under direction of the project manager, may perform some method development.

Selection Process: The selection will be on the basis of Interview.",
"url":"https://cliantha.com/main/pdf/career/Bioanalytical-Officer.pdf?fbclid=IwAR0bSrdz5MVAjnrA1ynR9HNbBh9BMhlHpJ5ktBkhEp7cdzY9RiXYpAvLffE"
},
{
"title":"Ancient Living Products Walk In 21st to 28th Sept 2020 for QC Chemist/production Chemist @ B.Pharm, B.Sc, M.Sc", 
"desc":"Ancient Living Products Pvt Ltd Walk In September 2020. Ancient Living Products Pvt Ltd is home to PLANT-BASED WELLNESS products that make you feel safe and loved. At Ancient Living, we have imbibed the soul and essence of Ayurveda, Science of Life!
 Important Vacancy details:

Post Name: QC Chemist/production Chemist
Education: B.Pharm, B.Sc, M.Sc
Experienced:02 to 5 years
Location:Hyderabad( APIIC Colony, Ramraj Nagar, Subhash Nagar, Shapur Nagar, Sr Naik Nagar, Suraram, HAL Colony, Sai Baba Nagar, Chanda Naik Nagar, Alluri Seetha Ramaraju Nagar, Jukal )
Salary : 1,75,000 – 2,75,000 P.A.
Openings :07
 Job Description: We have requirement for the post of QC Chemist/production Chemist in Ancient Living Products Pvt Ltd !

Planning of Raw materials, equipment, and manpower.
Supervision of production activities.
Preparation and implementation of Standard Operating Procedures.Documentation of production activities.
Liaison with stores, Quality control, Quality Assurance
 Time & Venue:21st September – 28 September , 9.30 AM – 5.30 PM Building no:1, Plot:66A, Phase: IV, IDA Jeediemta Hyderabad 500055 Contact – Sandhya ( 7780256153 )
 Selection Process: The selection will be on the basis of Interview.",
"url":""
},
{
"title":"Urgent Recruitment for Representative(SO) At Ajanta Pharma", 
"desc":"Ajanta Pharma Ltd Recruitment September 2020. Ajanta Pharma is a specialty pharmaceutical company engaged in development, manufacturing and marketing of quality finished dosages. Committed to ‘Serve Health Care Needs Worldwide’, we produce a comprehensive range of specialty products targeting different therapeutic segments for treatment of patients, customised to each market we are present in.
Important Vacancy details:
Post Name: Representative(SO)
Experienced:min 6 months to max 3 years
Location:Mysore
 Contact:Anil, DM @ 9986022021
 Job Description: We have requirement for the post of Representative(SO) in Ajanta Pharma Ltd !

Dear all, please refer a candidate for Post: Representative(SO)

Division: Nuventa Segment: cardiac & diabetic

Preferably from same segment Age: less than 27years

Selection Process: The selection will be on the basis of Interview.",
"url":"https://pharmajobalert.in/urgent-recruitment-for-representativeso-at-ajanta-pharma/"
},
{
"title":"Immediate Openings At Aurobindo Pharma Hiring Diploma for production / packing Freshers", 
"desc":"Aurobindo Pharma Recruitment September 2020.Aurobindo Pharma Limited is a pharmaceutical manufacturing company headquartered in HITEC City, Hyderabad, India. The company manufactures generic pharmaceuticals and active pharmaceutical ingredients.
Important Vacancy details:
Post Name: production / packing
Education: Diploma (Mechanical, Electrical, Electronics, Instrumentation) Freshers
Experienced:Freshers
Location: Hyderabad India.
Contact:Joshi A.A-+919491795337
Note:If interested candidates can share your resume to mentioned mail ID Below.
hr.atdc@aurobindo.com
Job Description: We have requirement for the post of production / packing in Aurobindo Pharma !
Greetings from Aurobindo.!
Currently vacancies available for production / packing in AUROBINDO TRAINING & DEVELOPMENT CENTER",
"url":"https://i2.wp.com/pharmajobalert.in/wp-content/uploads/2020/09/ADF.jpg?w=600&ssl=1"
},
{
"title":"Urgent Openings At Gland Pharma Hiring B Pharma,M Pharma,B.sc,M.sc,B.tech,M.tech for Quality Control & QA Validations", 
"desc":"Gland Pharma Ltd Recruitment September 2020. A globally renowned manufacturer of Small Volume Parenterals (SVPs), Gland Pharma was founded in 1978 at Hyderabad by a visionary, PVN Raju, who has always thought far ahead of his time. Since inception, Gland Pharma stands testimony to the founder’s exemplary commitment to Quality, having emerged as a global player with presence in about 90 countries in five continents.
Important Vacancy details:
Post Name: Quality Control & QA Validations
Education: B Pharma,M Pharma,B.sc,M.sc,B.tech,M.tech
Experienced:01 to 5 years
Location:Hyderabad
Salary :1,25,000 – 4,00,000 P.A.
Openings :25
Contact:08455-222000 – (3702/3636).
Job Description: We have requirement for the post of Quality Control & QA Validations in Gland Pharma Ltd !
Ensure Line Clearance activities at different stages in Compounding, Filling, Vial Washing, Tunnel and Sealing areas.
Performing the In-process checks during all the stages of manufacturing and packaging.
Planning and Monitoring & Execution of activities on shop floor.
Address:Gland Pharma Ltd. TSIIC-IP, III Phase, Plot No: 42-52, Pashamylaram. Pin: 502307. Land Mark: Besides KIRBY Lane. 08455-222000 -(3702/3636)
Selection Process: The selection will be on the basis of Interview
Note:If interested candidates can share your resume to mentioned mail ID Below.
hrd.pmy@glandpharma.com & hanumanthrao.rasike@glandpharma.com",
"url":"https://pharmajobalert.in/urgent-openings-at-gland-pharma-hiring-b-pharmam-pharmab-scm-scb-techm-tech-for-quality-control-qa-validations/"
},
{
"title":"Urgent Openings At Aspiro Pharma Hiring B.pharma,M.pharma,M.sc for QA / QC / AR&D / FR&D", 
"desc":"Aspiro Pharma Ltd Recruitment September 2020. Aspiro Pharma is one of the fast growing pharmaceutical companies in India fully dedicated to research, development and manufacturing of Generic Parenteral Formulations. Established in 2012, Aspiro specializes in manufacturing Powder, Lyophilized and Liquid products in the form of injectables, ophthalmics, Pre-filled Syringes (PFS) and IV Bags that find therapeutic application in treating a wide range of ailments.
Important Vacancy details:
Post Name: QA / QC / AR&D / FR&D
Education: B.Pharmacy / M.Pharmacy / M.Sc-Chemistry
Experienced:2017/ 2018/ 2019 passed outs only
Location: Hyderabad
 Note:If Intrested Candiadtes Send Updated Resume Below Email id .
vijayakiran.ch@heterodrugs.com (or) careers.aspiro@aspiropharma.com",
"url":"https://pharmajobalert.in/urgent-openings-at-aspiro-pharma-hiring-b-pharmam-pharmam-sc-for-qa-qc-ard-frd/"
},
{
"title":"Saga Lifescience Application Last Date On 30 th Sept 2020 for IPQA Officer @ B.sc,M.sc,B.pharma,M.pharma", 
"desc":"Saga Lifescience Limited Recruitment  September 2020. SAGA LIFESCIENCES LIMITED is a Public Company limited by Shares. It is registered with Registrar of Companies, Ahmedabad on Jul 10, 2019. Current Status of Saga Lifesciences Limited is Active. It is a Non-govt company with an Authorized Capital of ₹ 1,00,00,000 (One Crore Indian Rupees) and Paid Up Capital of ₹ 1,00,00,000 (One Crore Indian Rupees). There are 4 Directors associated with Saga Lifesciences Limited. They are: Viranchi Arvindbhai Shah, Vinit Arvindbhai Shah, Rushabh Vinit Shah and Ruchir Vinitbhai Shah.
Important Vacancy details:
Post Name: IPQA Officer
Education: B.Sc. Biotech /M.Sc Biotech, M.Pharma / B.Pharma
Experienced:02 to 4 years
Location:Ahmedabad, Gujarat
Salary : 17,000 a month
Contact Us: 8347011134/21/23

Job Description: We have requirement for the post of IPQA Officer in Saga Lifescience Limited !
IPQA Officer (In Process Quality Assurance Officer)
1. Online Clearness, friability testing
2. Handling of Tablets & Capsules
3. To prepare / review of QA SOPs.
4. To handle quality management system documents likes Change control proposals, Deviations, Incident reports, CAPA reports, OOS, NCR, Market Complaint, Returned goods and product recall.
5. To assist HOD for the investigation of deviation, incident and market complaints and its recordation.
6. Responsible for handling of validation, calibration & instrumentation department and to ensure completion of validation and calibration activity as per VMP.
7. URS / DQ / IQ / OQ / PQ protocols for various GMP equipment’s and utilities for routine and Projects.
8. Preparation and review of various GMP documents. Standard Operating Procedures (SOPs).Standard Test Procedures (STPs), Specifications
9. Handling of QMS likes Deviation / Change control / CAPA / OOS / NCR
Application Deadline: 30/9/2020",
"url":"https://www.indeed.co.in/viewjob?cmp=Saga-Lifescience-Limited&t=Ipqa%20Officer&jk=331a5519b99bd422&q=qa,qc%20chwmistry&vjs=3&fbclid=IwAR3EbRJUaW0UpTX4p8vMSLARj8hFmErhVNm5-sUzoNq4n6_K6_jrdJnsiSY"
},
{
"title":"", 
"desc":"",
"url":""
},
{
"title":"", 
"desc":"",
"url":""
},
{
"title":"", 
"desc":"",
"url":""
},
{
"title":"", 
"desc":"",
"url":""
},
{
"title":"", 
"desc":"",
"url":""
}
]
