[
{"title":"Annora Pharma Urgent Openings for Freshers & Experience – QC / Production",
"desc":"Annora Pharma Pvt. Ltd Recruitment May 2020 B.sc,M.sc,B.pharma,M.pharma for QC,Production @ Hyderabad.Interested candidates may Apply online for selection as detailed below.
Vacancy details:
Post Name: QC,Production
Qualification: B.sc,M.sc,B.pharma,M.pharma
Experience:0-3 years
Location - Hyderabad",
"url":"https://pharmajobalert.in/annora-pharma-urgent-openings-for-freshers-experience-qc-production/"},
{"title":"Alembic Pharma Ltd. Recruitment May 2020",
"desc":"Vacancy details:
Post Name: QA – AMV Reviewer (general OSD)
Qualification: B. PHARMA / M. SC,M.pharm
Experience:1 -7 Years
Job Description: Alembic Pharmaceuticals is looking for competent personnel to be an integral part of Quality Assurance team in Formulations (general OSD) plantbased at Panelav,Vadodara (Guj).
Must have experience in Method Validation Department as analyst or reviewer of method validation, method verification &method transfer activities.
Review of method validation and method verification Reports & Protocols.
Calibration and analysis on HPLC, GC, GC-MS, XRD, Potentiometer.
Handling of Laboratory Investigation Reports, EIA & OOT.
Monitoring of Good Laboratory Practices.
Interested candidates matching above criteria can send their resume on qualityform@alembic.co.in.
Important details:
Location: Vadodara",
"url":"https://www.naukri.com/job-listings-senior-executive-qa-amv-reviewer-general-osd-alembic-pharmaceuticals-limited-vadodara-baroda-4-to-8-years-290220006008?src=jobsearchDesk&sid=15889114386162492_2&xp=1&px=1"},
{"title":"Urgent Requirement for freshers",
"desc":"MSc micro
BSC micro
MSc/BSC biotech
Ambernath Plant (Mumbai)
Candidates belongs to  thane region will prefarable.
Badlapur, Ambernath, Dombivli and Kalyan.
Company- Bharat serum and vaccine limited",
"url":""},
{"title":"Aurobindo Pharma Hiring for Executive Production And Packing",
"desc":"Aurobindo Pharma Ltd Recruitment May 2020 B.Pharma – Pharmacy for Executive Production And Packing (OSD Only) @ Hyderabad. Interested candidates may Apply online for selection as detailed below.
Vacancy details:
Post Name: Executive Production And Packing (OSD Only)
Qualification: B.Pharma – Pharmacy
Experience: 1-5 yrs
Job Description: We have requirement for the post of Executive Production And Packing (OSD Only) in Aurobindo Pharma Ltd!
 Responsible for Day to day manufacturing and cleaning activities.
Responsible for Involving in process validation and Qualification activities
Responsible for Online entries in BMR,Equipment logs and instrument log books.
Responsible for Online entries of daily records like housekeeping, Temperature and RH monitoring etc.
Responsible for Online entry of WIP record.
Responsible for Online Reviewing of executed BMR.
Carry the production activities & achieve the targets monitoring of production operation.
Co-ordination with QA/QC and manufacturing, Department for proper production.
To check and record all the in Process parameters during “Packing” activity to assure Quality of the product.
To ensure online documentation of “Packing” activities.
To ensure In Process Check. Trouble shooting during packing activities.
Important details: 
Location: Hyderabad
Salary : INR 2,00,000 – 2,75,000 PA.
Openings : NA
Recruiter Name:Vamsi
Address :Plot No. 11, Water Mark Building,, Hitech City Rd, Whitefields, Kondapur, Hyderabad, Telangana – 500084,India",
 "url":"http://aurobindo.careersitemanager.com/job-listings-Opening-For-Executive-Production-and-Packing-OSD-Only-for-Hyderabad-Aurobindo-Pharma-Ltd-Hyderabad-Secunderabad-1-to-5-years-070520004697?xp=1"},
{"title":" Mylan Laboratories Recruitment R&D Quality Scientist/Senior Regulatory Associate SWARNALATHA",
"desc":"Vacancy details:
Post Name: R&D Quality Scientist/Senior Regulatory Associate
Qualification: B.Sc in Any Specialization, Chemistry, B.Pharma in Pharmacy,M.Pharma in Pharmacy
Experience: 3-9 yrs
 We are hiring for our Regulatory domain of Injectable R&D located at Bangalore.
The role holder is responsible for execution of all activities related to review of executed documents, compilation of the dossier, deficiency. Co-ordination with cross functional teams for completion of the assigned activity. This role reports to supervisor and is an individual contributor.
-Execute regulatory team activities as directed to achieve submission approval.
-Maintain general knowledge of regulations and guidance for one or more product types (Injectables, API, etc.) within designated region(s).
– Coordinate with stake holders (RnD, Plant and suppliers) for sourcing of documents and review of executed documents received.
– Review and evaluation of change control documents related to CMC. Approval of change control documents and quality information’s as assigned.
– Preliminary review of the dossier/submission.
Important details:
Location: Bengaluru( Jigani )",
"url":"https://companies.naukri.com/mylan-jobs/jobs/"},
{"title":"Johnson & Johnson Hiring Master’s/ Bachelor’s degree in Pharmacy, Science",
"desc":"Vacancy details:
Post Name: Complaint Vigilance Analyst
Qualification: Master’s/ Bachelor’s degree in Pharmacy, Science discipline
Experience: minimum of 3+ years of related experience in Quality Systems and Compliance with experience working in pharmaceutical, medical devices or other related or highly regulated industry
Johnson & Johnson India Pvt Ltd is recruiting for a Complaint Vigilance Analyst, located in Mumbai, India.
Other Skills:
Excellent verbal and written communication. Ability to read, write, speak and understand the English language.
Possesses strong organization and project management skills
Important details:
Location: Greater Mumbai, India",
"url":"https://jobs.jnj.com/jobs/2005819554W?lang=en-us&src=JB-10281"},
{"title":"Novo Nordisk Recruitment Associate Analyst – Regulatory Affairs Apply Online",
"desc":"Novo Nordisk Recruitment May 2020 Graduate or Post Graduate in Science or comparable degree in computer related field or equivalent professional experience for Associate Analyst – Regulatory Affairs @ Bangalore. Interested candidates may Apply online for selection as detailed below.

Vacancy details:

Post Name: Associate Analyst – Regulatory Affairs
Qualification: Graduate or Post Graduate in Science or comparable degree in computer related field or equivalent professional experience
Experience:3 – 5 years
The position
Your key responsibility will be Compilation and delivery of country specific files across IO for Renewals and Additional Manufacturing sites by preparing operational plan and check list of local requirements for each submission. Circulate the plans and requirements to RA in Affiliate for confirmation, TOC compilation according to compliance form or according to Site Transfer TOCs provided by RA CMC & Devices: search for documents in novoDOCS and populate TOC, Raise Publishing Online Form request according to submission size and publishing lead-times and QC of Published Output and Maintain the submission tracker.
Location - banglore",
"url":"https://www.novonordisk.co.in/content/India/AFFILIATE/www-novonordisk-co-in/en_us/novo-nordisk-india/careers/job-ad-display.40924.en_GB.html"},
{"title":"Cipla Ltd Recruitment QC analysts Apply Online", 
"desc":"Cipla Ltd Recruitment May 2020 B.Sc – Chemistry,MS/M.Sc(Science) – Chemistry for QC analysts @ Bengaluru . Interested candidates may Apply online for selection as detailed below.
Vacancy details:
Post Name:  QC analysts
Qualification: B.Sc – Chemistry,MS/M.Sc(Science) – Chemistry
Experience: 2 – 05 years
1)Have hands on good experience in analysis of finished products/Intermediates with respect to Chromatographic techniques like HPLC, GC & Ion chromatographic analysis.
2)Have good knowledge on documentation practices as per cGMP and ICH guidelines.
3)Have hands on experience in analytical techniques as well as in software’s handled like LIMS, Chromeleon, SAP etc….
Well aware on Good laboratory practices and Data integrity subjects.
4)Have good experience on trouble shooting during chromatographic analysis.
5)Should have good experience on handling/analysis of LCMS instruments as well as maintenance.
candidates with preferably with API pharma background please apply .
Important details: 
Location: Bengaluru
Salary : INR 2,50,000 – 4,75,000 PA.
Openings : 15
Recruiter Name:Arvind sharma
Email :arvind.sharma1@cipla.com",
"url":"https://www.naukri.com/job-listings-Looking-For-Quality-Control-Analysts-For-Bangalore-Cipla-Ltd-Bengaluru-Bangalore-2-to-5-years-070520003350?xp=1"},
{
 "title":"TCS Hiring 50% in 10th, 12th, UG & PG (if applicable) for  Senior Data Science Administrator", 
"desc":"
Tata Consultancy Services Limited Recruitment May 2020 Minimum percentile of 50% in 10th, 12th, UG & PG (if applicable). for Senior Data Science Administrator @ Hyderabad. Interested candidates may Apply online for selection as detailed below.
Vacancy details -

Post Name: Senior Data Science Administrator
Qualification: Minimum percentile of 50% in 10th, 12th, UG & PG (if applicable).
Experience: 7 – 12 years of experience
 Job Description: We have requirement for the post of Senior Data Science Administrator in Tata Consultancy Services Limited !
Must-Have:
Experience in MapR distribution – with Solid Data Science Tools set Admin
Experience along with good knowledge of Cloud infrastructure like Azure/ AWS)
Good to Have:
Knowledge on OS admin (Centos/ RHEL /Ubuntu).
Experience in Open source emerging tools and technologies related to data science like  Kubernetes/Dockers / Shiny / Jupyter / R / Python etc in preferred hosting platform like Azure/ AWS / On Prem.
Experience in DatabBase admin.
Minimum Qualification:
15 years of full-time education.
Minimum percentile of 50% in 10th, 12th, UG & PG (if applicable).
Note: “This posting is for future potential opportunities with TCS and not for any immediate requirement”.
Important details: 
Location: Hyderabad",
 "url":"https://ibegin.tcs.com/iBegin/jobs/156592J"
},
{
 "title":"Ameal pharmaceutical 30 Openings Freshers for Trainee officer / Trainee Associate and trainee", 
"desc":"Job Description: We have requirement for the post of Trainee officer / Trainee Associate and trainee in Ameal pharmaceutical !
vacancy details:

Post Name: Trainee officer / Trainee Associate and trainee
Qualification: B.Pharm, D.Pharm, Diploma, B.Sc. and ITI
Experienced:freshers candidates will be placed respective area based on their knowledge and interview.
Location: Ahmedabad
Salary :NA
Openings : 30 
 Interested candidates please send your cv to aartig@amnealindia.com ",
 "url":"https://i0.wp.com/pharmajobalert.in/wp-content/uploads/2020/05/Acc.png?w=442&ssl=1"
},
{
 "title":"Teva Pharmaceuticals Hiring B.Pharm,M.Pharm for Production Pharmacist", 
"desc":"Job Description: We have requirement for the post of Production Pharmacist in Teva Pharmaceuticals !
 Vacancy details:

Post Name: Production Pharmacist
Qualification: B.Pharmacy/M.Pharmacy
Experienced:5-6 year experiance.
Location: Goa
Salary :NA
Openings : NA
Responsibilities : 
To ensure compliance to Standard Operating Procedures (SOP)
To ensure compliance to the requirements of site procedures on Data integrity in GxP data handling
To look after manufacturing activities related Granulation area
To ensure maintenance of production area in the state of cleanliness and ready for manufacturing activities, as per the regulatory requirements at all points of time
Oversee and manage the training records for the production personnel. To ensure that the required initial and continuing training of the department personnel is carried out and adapted according to the need
Preparation of the SOP’s, qualification documents and calibration schedules
Preparation of Batch Manufaturing Record & to develop, implement Validation protocols and maintain the production documentation
Carry out all SAP related activities in a timely manner
To ensure all time readiness of department for system/facility/safety/documents",
 "url":"https://careers.teva/job/Goa-Production-Pharmacist-403722/650821800/"
},
{
 "title":"50 Openings Pharmacist Jobs AT Apollo pharmacy", 
"desc":"Apollo pharmacy Recruitment May 2020 Any Graduate in Any Specialization, B.Pharma in Pharmacy, for Pharmacist @ India-Pune, Mumbai
Vacancy details:

Post Name:  Pharmacist
Qualification: Any Graduate in Any Specialization, B.Pharma in Pharmacy,
Experienced:0 – 5 years
Location: India-Pune, Mumbai
Salary :NA
Openings : 50
At Apollo Pharmacy. ( Mumbai, Pune , Nashik & Nagpur Location )
Interested Candidates Can Whats App On Mr. Abhishek Arvind Meshram On 9004741674",
 "url":""
},
{
 "title":"Vacancy for Analytical Development, Formulation Development at Etico Lifesciences", 
"desc":"Formulation Development
Qualification : M. Pharmacy (Pharmaceutics/Industrial Pharmacy)
Years of Experience : Trainees, Freshers & 2-3 Years
1) Knowledge of Ophthalmic and Injectable dosage forms.
2) Handling of Ophthalmic Liquid. Suspension, Emulsion, Injectable Liquid, Suspension and Lyophilized Formulations.
3) Knowledge about the handling of Cytotoxic materials.
4) Knowledge about the safety aspects.
5) Knowledge about GLP and GMP.
6) Knowledge about the qualification of equipment and instruments.
7) Knowledge about regulatory' guidelines and requirements.

Analytical Development
Qualification : M. Pharmacy/M.Sc.
Years of Experience : Trainees, Freshers & 2-3 Years
1) Knowledge on Analytical Method Development of Ophthalmic Liquid, Suspension. Emulsion. Microsperes, Liposomes, Injectable Liquid. Suspension and Lyophilized Formulations.
2) Knowledge on Analytical Method Validation.
3) Knowledge about the handling of Analytical Instruments like HPLC, GC, etc.
4) Knowledge about the handling of Cytotoxic materials.
5) Knowledge about the safety aspects.
6) Knowledge on Method transfer activity R&D to Manufacturing plants
7) Knowledge about GLP and GMP.
8) Knowledge about the qualification of equipment and instruments.
9) Knowledge about regulatory guidelines and requirements.
",
 "url":"Forward your CV's to sindhura.tripuraneni@eticolifesciences.com"
},
{
 "title":"Ultra Drugs Hiring B.Pharm, M.Pharm or M.Sc freshers for Junior Officer QA", 
"desc":"Ultra Drugs Private Limited Recruitment May 2020 B.Pharm, M.Pharm or M.Sc can also apply. for Junior Officer QA @ Baddi
Vacancy details:

Post Name:  Junior Officer QA
Qualification: B.Pharm, M.Pharm or M.Sc can also apply.
Experienced:0-1 years
Location: Baddi
Salary :NA
Openings : NA
Contact Person: Kamna Sood
Contact Number : 7876892769
Candidate to be resposible for handling BMR

Verification of raw material
To review all documents of dispensing, granulation and compression
To monitor and ensure GMP Practices on shopfloor
IPQA qualtiyChecks .",
 "url":"https://www.naukri.com/job-listings-junior-officer-qa-ultra-drugs-private-limited-baddi-0-to-1-years-280520003185?src=jobsearchDesk&sid=15906755440976546_3&xp=8&px=3"
},
{
 "title":"Medreich Limited Hiring Freshers and experience for Officer – QA", 
"desc":"Medreich Limited Recruitment June 2020 B.Pharma ,M.Pharma in Pharmacy for Officer – Quality Assurance @ Bengaluru. Interested candidates Apply online
Vacancy details:

Post Name:  Officer – Quality Assurance
Qualification: B.Pharma ,M.Pharma in Pharmacy
Experienced: 0-5 Years
Location: Bengaluru
Salary :Not Disclosed by Recruiter
Candidate should have knowledge on Quality Assurance aspects such as IPQA, QMS practices, documentation & CAPA. ",
 "url":"Interested candidates Send Resume :udayashankar.s@medreich.com"
},
{
 "title":"", 
"desc":"",
 "url":""
},
{
 "title":"", 
"desc":"",
 "url":""
}
]
