[
{
 "title":"Hetero Drugs Limited Hiring M.Sc,B.tech,M.Tech for Analytical R&D professional", 
"desc":"Hetero Drugs Limited  is inviting eligible candidates to apply online for the position of Analytical R&D professional in Biologics / Bio-Similars / Biopharma.. Candidates can  find their eligibility from below details .Eligible and interested candidates can apply from the source may provided at the bottom of this article. This content to be used only for informational purpose and not responsible for the inaccuracy or deficiency of the provided information.

Qualification: B.Tech/B.E. – Bio-Chemistry/Bio-Technology,M.Tech – Bio-Chemistry/Bio-Technology, Biomedical – MS/M.Sc(Science) – Organic Chemistry

Experience required: 4 – 9 Years 

Post Name:   Analytical R&D professional in Biologics / Bio-Similars / Biopharma.",
 "url":"http://careers.heterodrugs.com/job-listings-Analytical-R-D-Biologics-bio-similars-biopharma-Hetero-Drugs-Limited-Hyderabad-Secunderabad-4-to-9-years-210319002080?xp=1"
},
{
"title":"Biocon Hiring M.Sc for Senior Scientist", 
"desc":"Biocon is a subsidiary of Biocon Ltd, an innovation led global biopharmaceuticals company and India’s ﬁrst publicly listed biotech enterprise. … The company aspires to transform patient lives through innovative and inclusive healthcare solutions.
 Biocon Hiring M.Sc for Senior Scientist SWARNALATHA B September 19, 2020
Biocon Recruitment September 2020. Biocon is a subsidiary of Biocon Ltd, an innovation led global biopharmaceuticals company and India’s ﬁrst publicly listed biotech enterprise. … The company aspires to transform patient lives through innovative and inclusive healthcare solutions.

Important Vacancy details:

Post Name: Senior Scientist
Education:  M.Sc
Experienced:02 to 5 years
Location: India
 ",
"url":"https://career10.successfactors.com/career?career_ns=job_listing&company=bioconlimi&navBarLevel=JOB_SEARCH&rcm_site_locale=en_US&career_job_req_id=1654&selected_lang=en_US&jobAlertController_jobAlertId=&jobAlertController_jobAlertName=&_s.crb=Po51bf7zSbD1YHK9103KIuggUQ%2BznogfVGwjjye2c1M%3D&fbclid=IwAR0ExOISsMOzwm36mmr-sQnuwXUukIkHbGWbIC9JEN4V90mmsmXLKYlrtpI"
},
{
"title":"Rainbow Medinova Diagnostic Services Hiring B.sc,M.sc for Microbiologist & Microbiology Technicians", 
"desc":"Rainbow Medinova Diagnostic Centre – Service Provider of health check up centers, sonography centers & blood testing services in Nagpur, Maharashtra.

Important Vacancy details:

Post Name: Microbiologist & Microbiology Technicians
Qualification: B.sc,M.sc
Experienced:1 years
Location:Ramdas Peth, Nagpur, Maharashtra
 Contact:9405906982/9028940280",
"url":"https://pharmajobalert.in/rainbow-medinova-diagnostic-services-hiring-b-scm-sc-for/"
},
{
"title":"Accurex Biomedical Hiring B.sc,M.sc,B.tech,MBA,Bachelor’s degree for Sales/B2B/Marketing/Regulatory/Production", 
"desc":"Accurex Biomedical Pvt. Ltd Recruitment September 2020. Established in 1984, Accurex Biomedical Pvt. Ltd. is one of the top 3 manufacturers of quality Clinical Chemistry Reagents and Urinanalysis Test Strips with over 35 years of expertise in this area. Our company name is composed of two words, ACCU and REX. ‘ACCU’ refers to the word ‘accurate’. Its definition as described by Oxford dictionary portrays the essence of our existence. ‘REX’, a Latin word for ‘king’, speaks of our authoritative influence in the diagnostic industry
Important Vacancy details:
Post Name: Sales/B2B/Marketing/Regulatory/Production
Education:B.Sc /DMLT/MBA and / BE/M.sc/Bachelor’s degree
Experienced:1 to 5 years
Location: Asansol, Mumbai, Chennai, Jaipur, Baroda, Indore,Boisar
",
"url":"https://accurex.net/careers-2/?fbclid=IwAR1TLJs34m00MvuJgvBSn89iwYoux23j39xyFqrvS-ptUPbpFNGqkXq-d2k"
},
{
"title":"Accenture Hiring B.sc for Clinical Data Management (CDM)", 
"desc":"Accenture Recruitment September 2020. Accenture is a leading global professional services company, providing a broad range of services in strategy and consulting, interactive, technology and operations, with digital capabilities across all of these services. We combine unmatched experience and specialized capabilities across more than 40 industries – powered by the world’s largest network of Advanced Technology and Intelligent Operations centers.
Important Vacancy details:
Post Name: Clinical Data Management (CDM)
Education: B.sc
Experienced:01 to 3 years
Location: Bengaluru
 Job Description: We have requirement for the post of Clinical Data Management (CDM) in Accenture !

You will be aligned with our Pharmaceuticals Processes vertical and help us with the processes to collect, monitor, research, assess and evaluate information on the adverse effects of medication with a view to identifying new information about hazards associated with medicines and consequently, prevent harm to patients. It also deals with the reviewing and resolving of discrepancies identified by the system or through manual checks as per guidelines. Employees under this span can also be responsible for a number of activities related to the design, development, and maintenance of Clinical Database objects.
 You will be working as a part of the Data Maintenance team which is responsible for completeness & validity of the data in the clinical database. The team reviews and resolves discrepancies identified by the system or through manual checks as per guidelines, issue data clarification forms as and when required. You will have to perform discrepancy review & perform Self-Evident Corrections per DRP (as and when required). You will also solve for discrepancy management for SAE related discrepancies.

The Clinical Data Management focuses on the collection, integration and the availability of data at appropriate quality and cost. The team is responsible for performing data management activities including discrepancy review, query generation and resolution. The team is also responsible for creating CRF Completion Guidelines (CCG) and SAE reconciliation guidelines. The role may require you to identify and raise protocol deviations in the database, perform edit check validation by creating test cases, write test scripts and carry-out database validation (UAT) against the specified CRF/ECRF. The role may also need expertise in managing clinical data management projects.

Good to have skills: Data Management,Good communication skills",
"url":"https://www.accenture.com/in-en/careers/jobdetails?id=46968_india_2&title=12-Data%20Maintenance&fbclid=IwAR1DWuP-xwjiNLUTDBP8DIUKIwh6bSESKIRfJPsJzo8w5TvIx-NmvJAz6m0"
},
{
"title":"Cliantha Research Hiring B.Pharm,M.Pharm,M.Sc for Bioanalytical-Officer / Sr. Officer/ Executive / Sr. Executive", 
"desc":"Cliantha Research Limited Recruitment September 2020. Cliantha Research, a full-service Clinical Research Organization (CRO), is a leading provider of Clinical research services, based in Ahmedabad, India. Cliantha’s motto is Science with Integrity.
Important Vacancy details:
Post Name: Bioanalytical-Officer / Sr. Officer/ Executive / Sr. Executive
Education:B.Pharm / M.Pharm / M.Sc
Experienced:01 to 4 years
Location: Ahmedabad
Note:If interested candidates can share your resume to mentioned mail ID Below.
dmirchandani@cliantha.com & azode@cliantha.com
Job Description: We have requirement for the post of Bioanalytical-Officer / Sr. Officer/ Executive / Sr. Executive in Cliantha Research Limited !
Centrifuges, evaporators, freeze specimens as required.
• Performs aliquots of samples for wet chemistry.
• Performs wet chemistry according to study protocol guidelines and/or SOPs.
• Completes QC sheets and makes log book entries as required by protocol and/or SOP.
• Operate HPLC, LC/MS/MS and ICP-OES; troubleshoots problems and performs minor
repairs.
• Prepares required reagents and solvents.
• Under direction of the project manager, may perform some method development.

Selection Process: The selection will be on the basis of Interview.",
"url":"https://cliantha.com/main/pdf/career/Bioanalytical-Officer.pdf?fbclid=IwAR0bSrdz5MVAjnrA1ynR9HNbBh9BMhlHpJ5ktBkhEp7cdzY9RiXYpAvLffE"
},
{
"title":"Ancient Living Products Walk In 21st to 28th Sept 2020 for QC Chemist/production Chemist @ B.Pharm, B.Sc, M.Sc", 
"desc":"Ancient Living Products Pvt Ltd Walk In September 2020. Ancient Living Products Pvt Ltd is home to PLANT-BASED WELLNESS products that make you feel safe and loved. At Ancient Living, we have imbibed the soul and essence of Ayurveda, Science of Life!
 Important Vacancy details:

Post Name: QC Chemist/production Chemist
Education: B.Pharm, B.Sc, M.Sc
Experienced:02 to 5 years
Location:Hyderabad( APIIC Colony, Ramraj Nagar, Subhash Nagar, Shapur Nagar, Sr Naik Nagar, Suraram, HAL Colony, Sai Baba Nagar, Chanda Naik Nagar, Alluri Seetha Ramaraju Nagar, Jukal )
Salary : 1,75,000 – 2,75,000 P.A.
Openings :07
 Job Description: We have requirement for the post of QC Chemist/production Chemist in Ancient Living Products Pvt Ltd !

Planning of Raw materials, equipment, and manpower.
Supervision of production activities.
Preparation and implementation of Standard Operating Procedures.Documentation of production activities.
Liaison with stores, Quality control, Quality Assurance
 Time & Venue:21st September – 28 September , 9.30 AM – 5.30 PM Building no:1, Plot:66A, Phase: IV, IDA Jeediemta Hyderabad 500055 Contact – Sandhya ( 7780256153 )
 Selection Process: The selection will be on the basis of Interview.",
"url":""
},
{
"title":"Urgent Recruitment for Representative(SO) At Ajanta Pharma", 
"desc":"Ajanta Pharma Ltd Recruitment September 2020. Ajanta Pharma is a specialty pharmaceutical company engaged in development, manufacturing and marketing of quality finished dosages. Committed to ‘Serve Health Care Needs Worldwide’, we produce a comprehensive range of specialty products targeting different therapeutic segments for treatment of patients, customised to each market we are present in.
Important Vacancy details:
Post Name: Representative(SO)
Experienced:min 6 months to max 3 years
Location:Mysore
 Contact:Anil, DM @ 9986022021
 Job Description: We have requirement for the post of Representative(SO) in Ajanta Pharma Ltd !

Dear all, please refer a candidate for Post: Representative(SO)

Division: Nuventa Segment: cardiac & diabetic

Preferably from same segment Age: less than 27years

Selection Process: The selection will be on the basis of Interview.",
"url":"https://pharmajobalert.in/urgent-recruitment-for-representativeso-at-ajanta-pharma/"
},
{
"title":"Immediate Openings At Aurobindo Pharma Hiring Diploma for production / packing Freshers", 
"desc":"Aurobindo Pharma Recruitment September 2020.Aurobindo Pharma Limited is a pharmaceutical manufacturing company headquartered in HITEC City, Hyderabad, India. The company manufactures generic pharmaceuticals and active pharmaceutical ingredients.
Important Vacancy details:
Post Name: production / packing
Education: Diploma (Mechanical, Electrical, Electronics, Instrumentation) Freshers
Experienced:Freshers
Location: Hyderabad India.
Contact:Joshi A.A-+919491795337
Note:If interested candidates can share your resume to mentioned mail ID Below.
hr.atdc@aurobindo.com
Job Description: We have requirement for the post of production / packing in Aurobindo Pharma !
Greetings from Aurobindo.!
Currently vacancies available for production / packing in AUROBINDO TRAINING & DEVELOPMENT CENTER",
"url":"https://i2.wp.com/pharmajobalert.in/wp-content/uploads/2020/09/ADF.jpg?w=600&ssl=1"
},
{
"title":"Urgent Openings At Gland Pharma Hiring B Pharma,M Pharma,B.sc,M.sc,B.tech,M.tech for Quality Control & QA Validations", 
"desc":"Gland Pharma Ltd Recruitment September 2020. A globally renowned manufacturer of Small Volume Parenterals (SVPs), Gland Pharma was founded in 1978 at Hyderabad by a visionary, PVN Raju, who has always thought far ahead of his time. Since inception, Gland Pharma stands testimony to the founder’s exemplary commitment to Quality, having emerged as a global player with presence in about 90 countries in five continents.
Important Vacancy details:
Post Name: Quality Control & QA Validations
Education: B Pharma,M Pharma,B.sc,M.sc,B.tech,M.tech
Experienced:01 to 5 years
Location:Hyderabad
Salary :1,25,000 – 4,00,000 P.A.
Openings :25
Contact:08455-222000 – (3702/3636).
Job Description: We have requirement for the post of Quality Control & QA Validations in Gland Pharma Ltd !
Ensure Line Clearance activities at different stages in Compounding, Filling, Vial Washing, Tunnel and Sealing areas.
Performing the In-process checks during all the stages of manufacturing and packaging.
Planning and Monitoring & Execution of activities on shop floor.
Address:Gland Pharma Ltd. TSIIC-IP, III Phase, Plot No: 42-52, Pashamylaram. Pin: 502307. Land Mark: Besides KIRBY Lane. 08455-222000 -(3702/3636)
Selection Process: The selection will be on the basis of Interview
Note:If interested candidates can share your resume to mentioned mail ID Below.
hrd.pmy@glandpharma.com & hanumanthrao.rasike@glandpharma.com",
"url":"https://pharmajobalert.in/urgent-openings-at-gland-pharma-hiring-b-pharmam-pharmab-scm-scb-techm-tech-for-quality-control-qa-validations/"
},
{
"title":"Urgent Openings At Aspiro Pharma Hiring B.pharma,M.pharma,M.sc for QA / QC / AR&D / FR&D", 
"desc":"Aspiro Pharma Ltd Recruitment September 2020. Aspiro Pharma is one of the fast growing pharmaceutical companies in India fully dedicated to research, development and manufacturing of Generic Parenteral Formulations. Established in 2012, Aspiro specializes in manufacturing Powder, Lyophilized and Liquid products in the form of injectables, ophthalmics, Pre-filled Syringes (PFS) and IV Bags that find therapeutic application in treating a wide range of ailments.
Important Vacancy details:
Post Name: QA / QC / AR&D / FR&D
Education: B.Pharmacy / M.Pharmacy / M.Sc-Chemistry
Experienced:2017/ 2018/ 2019 passed outs only
Location: Hyderabad
 Note:If Intrested Candiadtes Send Updated Resume Below Email id .
vijayakiran.ch@heterodrugs.com (or) careers.aspiro@aspiropharma.com",
"url":"https://pharmajobalert.in/urgent-openings-at-aspiro-pharma-hiring-b-pharmam-pharmam-sc-for-qa-qc-ard-frd/"
},
{
"title":"Saga Lifescience Application Last Date On 30 th Sept 2020 for IPQA Officer @ B.sc,M.sc,B.pharma,M.pharma", 
"desc":"Saga Lifescience Limited Recruitment  September 2020. SAGA LIFESCIENCES LIMITED is a Public Company limited by Shares. It is registered with Registrar of Companies, Ahmedabad on Jul 10, 2019. Current Status of Saga Lifesciences Limited is Active. It is a Non-govt company with an Authorized Capital of ₹ 1,00,00,000 (One Crore Indian Rupees) and Paid Up Capital of ₹ 1,00,00,000 (One Crore Indian Rupees). There are 4 Directors associated with Saga Lifesciences Limited. They are: Viranchi Arvindbhai Shah, Vinit Arvindbhai Shah, Rushabh Vinit Shah and Ruchir Vinitbhai Shah.
Important Vacancy details:
Post Name: IPQA Officer
Education: B.Sc. Biotech /M.Sc Biotech, M.Pharma / B.Pharma
Experienced:02 to 4 years
Location:Ahmedabad, Gujarat
Salary : 17,000 a month
Contact Us: 8347011134/21/23

Job Description: We have requirement for the post of IPQA Officer in Saga Lifescience Limited !
IPQA Officer (In Process Quality Assurance Officer)
1. Online Clearness, friability testing
2. Handling of Tablets & Capsules
3. To prepare / review of QA SOPs.
4. To handle quality management system documents likes Change control proposals, Deviations, Incident reports, CAPA reports, OOS, NCR, Market Complaint, Returned goods and product recall.
5. To assist HOD for the investigation of deviation, incident and market complaints and its recordation.
6. Responsible for handling of validation, calibration & instrumentation department and to ensure completion of validation and calibration activity as per VMP.
7. URS / DQ / IQ / OQ / PQ protocols for various GMP equipment’s and utilities for routine and Projects.
8. Preparation and review of various GMP documents. Standard Operating Procedures (SOPs).Standard Test Procedures (STPs), Specifications
9. Handling of QMS likes Deviation / Change control / CAPA / OOS / NCR
Application Deadline: 30/9/2020",
"url":"https://www.indeed.co.in/viewjob?cmp=Saga-Lifescience-Limited&t=Ipqa%20Officer&jk=331a5519b99bd422&q=qa,qc%20chwmistry&vjs=3&fbclid=IwAR3EbRJUaW0UpTX4p8vMSLARj8hFmErhVNm5-sUzoNq4n6_K6_jrdJnsiSY"
},
{
"title":"Acme Generics LLP Recruitment for Packing/Engineering/Tech Transfer/Regulatory Affairs/Business Development/Quality Assurance ", 
"desc":"Acme Generics LLP Recruitment September 2020. Acme Generics LLP is a newly constructed research based formulation facility, situated at Village Davni, Baddi, Distt. Solan (H.P) and about 60 km from Chandigarh Airport. The factory is situated in an open space with adequate green area surrounding the building
Important Vacancy details:
Post Name: Packing/Engineering/Tech Transfer/Regulatory Affairs/Business Development/Quality Assurance/QC,Production
Experienced:01 to 18 years
Location:Solan (H.P.)
Contact:01795-248301-02-03
 Selection Process: The selection will be on the basis of Interview.",
"url":"http://www.acmegenerics.in/career.php?start=20&page=3&fbclid=IwAR2fhCHN4S_jiuq6s7r14Pm5_AiVejFUIocsi8Rlp6rOBnWXA5dpByGilkg"
},
{
"title":"92 Openings At State Bank of India Application Last Date On 8th Oct 2020 for Specialist Cadre Officer & Post Doctoral Research Fellow", 
"desc":"State Bank of India (SBI) Recruitment September 2020. State Bank of India is an Indian multinational, public sector banking and financial services statutory body headquartered in Mumbai, Maharashtra. SBI is ranked 236th in the Fortune Global 500 list of the world’s biggest corporations of 2019.
Important Vacancy details:
ost Name: Specialist Cadre Officer & Post Doctoral Research Fellow
Education:M.Sc. (Statistics),MBA
Location: Mumbai
Openings :92
Job Description: We have requirement for the post of Specialist Cadre Officer & Post Doctoral Research Fellow in State Bank of India (SBI) !
Last Date to Apply Online & Fee Payment: 08-10-2020",
"url":"http://www.freejobalert.com/sbi-specialist-officer/22492/#ixzz6YTRu6IRd"
},
{
"title":"3800 Openings At National Health Mission,MP Application Last Date On 8th Oct 2020 for Community Health Officer", 
"desc":"National Health Mission, Madhya Pradesh Recruitment September 2020. The National Health Mission was launched by the government of India in 2013 subsuming the National Rural Health Mission and National Urban Health Mission. It was further extended in March 2018, to continue until March 2020.
Important Vacancy details:
Post Name: Community Health Officer
Education:B.Sc. (Nursing) 
Location: Madhya Pradesh
Openings :3800
Job Description: We have requirement for the post of Community Health Officer in National Health Mission, Madhya Pradesh !
Last Date of submission of online application is October 08, 2020 at 11:59 PM.",
"url":"https://img.freejobalert.com/uploads/2020/09/Notification-NHM-MP-Community-Health-Officer-Posts.pdf?fbclid=IwAR2eY3icC1HgrJTNAOHyZKFHEavfmcC17YN7PkgCC3NdKKysYsX8ACjdmQA"
},
{
"title":"Sri Krishna Pharmaceuticals Hiring M.sc,M.pharma,B.tech for Trainee- FR&D-Nutraceuticals", 
"desc":"Important Vacancy details:

Post Name: Trainee- FR&D-Nutraceuticals
Qualification: M.Sc.(Organic Chemistry),M.Pharma(Organic Chemistry).,B.tech
Experienced:Freshers
Location:Hyderabad(Bolarum)
Note:If interested candidates can share your resume to mentioned mail ID Below.
thulasi.gajula@srikrishnapharma.com
Job Description: We have requirement for the post of Trainee- FR&D-Nutraceuticals in Sri Krishna Pharmaceuticals Ltd !

Looking for Freshers have any of below qualification.
Chemical Engineer,M.Sc.(Organic Chemistry),M.Pharma(Organic Chemistry).
Department:FR&D
Selection Process: The selection will be on the basis of Interview.
",
"url":"https://pharmajobalert.in/sri-krishna-pharmaceuticals-hiring-m-scm-pharmab-tech-for-trainee-frd-nutraceuticals/"
},
{
"title":"Urgent Openings At Otsuka Pharmaceuticals Hiring B.Pharm,M.Pharm,B.Sc,M.Sc for QC / QA / Production / ADL", 
"desc":"Otsuka Pharmaceuticals Ltd  Recruitment September 2020. Otsuka Pharmaceutical India Private Limited (OPI) is a Joint Venture between Otsuka Pharmaceutical Factory, Inc., Japan and Mitsui & Co. Ltd., Japan, India, for Infusion Business in India and Emerging Markets.
Important Vacancy details:
Post Name: QC / QA / Production / ADL
Education: B.Pharm / M.Pharm / B.Sc / M.Sc (Chemistry, Biotech, Microbiology)
Experienced:2 to 6 years
Location: Ahmedabad

Job Description: We have requirement for the post of QC / QA / Production / ADL in Otsuka Pharmaceuticals Ltd  !
Officer- QC @ Otsuka Pharma, Ahmedabad (Japanese MNC)
To carry out the sampling of all the materials according to Procedure 
To carry out the testing of Raw Material and Packing Material according to approved procedure.
To release Raw Material and Packing Material.
To carry out the calibration of instruments as per the schedule.
To prepare the working standards as per the guidelines and various pharmacopoeias.
To ensure the status tag on the released material and transfer such material in the released area.
To analyze the artworks as per the guidelines.
To follow the Good Laboratory practices and Good Manufacturing practices (GMP).
To prepare reagent & volumetric solution and standardize it.

Officer- QA @ Otsuka Pharmaceutical, Ahmedabad
To verify raw material, primary packing material at the time of material issuance and material dispensing.
To perform routine IPQA monitoring like volume check, critical control step verification during manufacturing of the product, sampling and periodic verification activities.
To verify sample / good destruction process .
Receipt and handling of data loggers. 
To carry out reconciliation and physical verification of the returned goods.
Officer/ Sr. Officer- Production
To ensure the cleanliness and environmental norms of various area like dispensing, compounding, filling, capping, including airlocks .
To ensure cleaning and disinfection of floor, ceiling, wall and equipments.
To ensure that the maintenance of dispensing compounding, filling, capping, including airlocks is as per Standard Operating Procedure (SOP) norms.
To carry out planning of material issue and dispensing as per priority of batch manufacturing.
To prepare documents regarding material issue and dispensing.
We are looking for qualified and experienced candidates for our Manufacturing operations. Candidates possessing good communication skill and exposure in Parental formulations   

ADL Officer _ Otsuka Pharmaceutical, Ahmedabad
Responsible for Analytical Method Validation and Method Development activity.
To perform F&D sample analysis.
Responsible for Good Lab Practices (GLP) Activities and its complies.
Responsible for Calibration of lab instruments.
Preparation and review of Validation Protocols/Reports and Analytical Reports including data.
Note:If interested candidates can share your resume to mentioned mail ID Below.
hrm.opmf-amd@otsukapharma.in / sagar.somaiya@otsukapharma.in",
"url":"https://pharmajobalert.in/urgent-openings-at-otsuka-pharmaceuticals-hiring-b-pharmm-pharmb-scm-sc-for-qc-qa-production-adl/"
},
{
"title":"Urgent Openings At Tuton Pharmaceuticals Hiring M.Pharm,B.Pharm,B.Sc for QC & QA Manager / Manufacturing Chemist", 
"desc":"Tuton Pharmaceuticals  Recruitment September 2020. Nestibulum lareorisku nueg placera dpuire ame licituin nvoluitpae convlrs sevitae in tincidusn nelcerais voluitat augue bgimen ornare elend. Ellentesque habitant ero mbsori tristique senectus malesuada fames ture egestas magna quis magna sodales luctus placera dpuire licituin nvoluitpae convlrs sevitae in tincidusn.
Important Vacancy details:
Post Name: QC & QA Manager / Manufacturing Chemist
Education:M.Pharm / B.Pharm / B.Sc
Experienced:5 to 20 years
Location: India
Job Description: We have requirement for the post of QC & QA Manager / Manufacturing Chemist in Tuton Pharmaceuticals  !
Post: QA / QC Manager
Candidate should be M.Pharm / B.Pharm / B.Sc having 15-20 yrs exp.
Post: Manufacturing Chemist (Approved Tablet)
Candidates should be B.Pharm / B.Sc having minimum 5-10 yrs exp.
Selection Process: The selection will be on the basis of Interview.
Note:If interested candidates can share your resume to mentioned mail ID Below.
jaimish@tutonpharma.com / pankil@tutonpharma.com",
"url":"https://pharmajobalert.in/urgent-openings-at-tuton-pharmaceuticals-hiring-m-pharmb-pharmb-sc-for-qc-qa-manager-manufacturing-chemist/"
},
{
"title":"Aurigene Discovery Hiring M.Sc for Cell & Molecular Biology", 
"desc":"Aurigene Discovery Recruitment  September 2020. Aurigene is a clinical stage biotech company committed to bringing novel therapeutics for the treatment of cancer and inflammation.Based in Bangalore and Kuala Lumpur, Aurigene has fully integrated Drug Discovery & Development infrastructure from Hit Generation to Clinical Development.
Important Vacancy details:
Post Name: Cell & Molecular Biology
Education: M.Sc.
Experienced:03 to 5 years
Location:Bangalore
Openings :02
Contact:9590737048
Note:If interested candidates can share your resume to mentioned mail ID Below.
preeti_s@aurigene.com",
"url":"https://i0.wp.com/pharmajobalert.in/wp-content/uploads/2020/09/aur-1.png?resize=768%2C429&ssl=1"
},

{
"title":"Lucid Laboratories Hiring B.Pharma,M.sc,M.Pharma,B.sc for Freshers & Experienced @ Analyst – Drugs & Pharma Testing", 
"desc":"Lucid Laboratories Private Limited Recruitment September 2020. Lucid Laboratories Private Limited, an NABL accredited analytical laboratory, offers Biological, Chemical and Mechanical testing services along with Validations, Research and Failure investigations.
Important Vacancy details:
Post Name: Analyst – Drugs & Pharma Testing
Education:B.Pharma,M.sc,M.Pharma,B.sc
Experienced:0 to 2 years
Location:India
Note:If interested candidates can share your resume to mentioned mail ID Below.
hr@lucidlabsindia.com.
 
Job Description: We have requirement for the post of Analyst – Drugs & Pharma Testing in Lucid Laboratories Private Limited !
Expertise on handling & calibration UV-VIS, HPLC, GC, GC-MS, FTIR & WET Chemistry.
Preparation & maintenance of reagents & volumetric solutions.
Handling of OOS, Deviations, Incidents.
Knowledge of GLP, ICH, FDA, EMEA, Method Verification & Validation.
Required Candidate profile:
Good analytical and communication skills with a long term commitment.
Strong motive to learn quickly and put into practice.
Good Computer Skills(MS Office) and LIMS. Immediate joinees preferred. ",
"url":"https://www.lucidlabsindia.com/careers.html"
},
{
"title":"Urgent Openings At USV Pvt. Ltd Recruitment for Production / QC / QA / IPQA / Engineering / Warehouse Departments", 
"desc":"USV Pvt. Ltd Recruitment September 2020. USV Private Limited is an Indian multinational pharmaceutical and biotechnology company based in Mumbai, India. The company was founded by Vithal Balkrishna Gandhi and Leena Tewari, his granddaughter, is the chairperson.
Important Vacancy details:
Post Name: Production / QC / QA / IPQA / Engineering / Warehouse Departments
Education: : 10th /12th/ ITI/Diploma/B.Pharm/M.Pharm/M.sc/B.com/B.sc
Experienced:01 to 8 years
Location:Daman
contact :  0260 6636232/6636229

Job Description: We have requirement for the post of Production / QC / QA / IPQA / Engineering / Warehouse Departments in USV Pvt. Ltd !
Technician-Production
Criteria
Qualification:- 10th + ITI
Experience: – 1-4 years in regulatory company
Age 21 – 26 years
With good skills on compression, coating and granulation machines operations.
Technician-Engineering
Criteria
Qualification:-  ITI / Diploma
Experience: – 3-7 years in regulatory company
Age 20 – 26 year
Should have good knowledge of BMS and HVAC operation and maintenance of utilities.
Deputy Manager (IPQA) -Quality Assurance
Criteria
Qualification:- B.Pharm/M.Pharm/M.sc
Experience: – 8-12years in regulatory company
Age 28-34 years
Should have relevant experience of IPQA.
Executive & Sr. Officer (QMS and Qualification) – Quality Assurance
Criteria
Qualification:-  B.Pharm/M.Pharm/M.sc
Experience: – 4-8years in regulatory company
Age 22-30 years
Should have knowledge of QMS and Qualification
Executive-Quality Control
Criteria
Qualification:-   B.sc/M.sc
Experience: – 4-8years in regulatory company
Age 22 – 30 years
Should have knowledge of analytical analysis.
Junior Officer/ Senior Officer -Warehouse
Criteria
Qualification:-  B.Pharm/B.Sc/M.Sc/B.com
Experience: – 2-4years in regulatory company
Age 22-30years
Good knowledge of dispensing and warehouse process.
Technician-Warehouse
Criteria
Qualification:- 10 th + ITI
Experience: – 1-4 years in regulatory company
hould have good knowledge of dispensing and warehouse process..
Selection Process: The selection will be on the basis of Interview.
Note:If interested candidates can share your resume to mentioned mail ID Below.
 ajeet.singh@usv.in, sanafatma.khan@usv.in, mahesh.joshi@usv.in",
"url":"https://pharmajobalert.in/urgent-openings-at-usv-pvt-ltd-recruitment-for-production-qc-qa-ipqa-engineering-warehouse-departments/"
},
{
"title":"Novartis Hiring Bachelor or higher in Biochemistry for Quality Assurance Manager", 
"desc":"Novartis Recruitment September 2020.Novartis is a global healthcare company based in Switzerland that provides solutions to address the evolving needs of patients worldwide. .Novartis Notification full detailes below.
Important Vacancy details:
Post Name: Quality Assurance Manager
Education: Bachelor or higher in Biochemistry, Chemistry or another related science.
Experience:10 years
Location: Mumbai
 Job Description: Hiring For Quality Assurance Manager in Novartis!
To ensure appropriate quality oversight, assessment and mitigation of quality risks, that may potentially negatively impact the supply of purchased strategic ESO chemicals (regulatory starting materials, Intermediates and API’s), and to ensure that all aspects of the relationship and management thereof, are in compliance with cGMP’s, regulatory requirements, the Novartis Quality Manual and Pharma industry practices.
Selection Process: The selection will be on the basis of Interview.
 ",
"url":"https://sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?partnerid=13617&siteid=5260&PageType=JobDetails&jobid=2712420&codes=IND&fbclid=IwAR0oNVqmtRkw3fChziAX3KX39p_uRCgBCeRc0WV6IRRg9xkyLvbGtR8GoFQ#jobDetails=2712420_5260"
},
{
"title":"Syngene Hiring Diploma,B.sc,B.pharma,B.tech for Discovery Toxicology- PCO BBRC- Senior Research Associate", 
"desc":"Syngene Recruitment September 2020.Incorporated in 1993, Syngene International Ltd. is an innovation-focused global discovery, development and manufacturing organization providing integrated scientific services to the pharmaceutical, biotechnology, nutrition, animal health, consumer goods and specialty chemical industries around the world.Syngene Notification full detailes below.
 Important Vacancy details:
Post Name: Discovery Toxicology- PCO BBRC- Senior Research Associate
Qualification:Diploma,B.sc,B.pharma,B.tech
Experience:03 – 8 years
Location: Bengaluru
Salary: 2,25,000 – 4,50,000 P.A.
Openings: 01
Note:If interested candidates can share your resume to mentioned mail ID Below.
Gunjan.shah1@syngeneintl.com or swetha.p@syngeneintl.com.
 Job Description: Hiring For Discovery Toxicology- PCO BBRC- Senior Research Associate in Syngene!

The candidate must have a thorough technical knowledge and hands on experience in various routine histology techniques. Should have an ability to conduct necropsy of laboratory rodents, organ collection, identification, tissue trimming, embedding and sectioning procedures independently Must have a relevant experience on processing and sectioning of tissues from laboratory animals Ability to handle clinical pathology instruments will be considered as an added advantage

Selection Process: The selection will be on the basis of Interview.",
"url":"https://pharmajobalert.in/syngene-hiring-diplomab-scb-pharmab-tech-for-discovery-toxicology-pco-bbrc-senior-research-associate/"
},
{
"title":"Urgent Requirement At Aurobindo Pharma Hiring Diploma for production / packing Freshers", 
"desc":"Aurobindo Pharma Recruitment September 2020.Aurobindo Pharma Limited is a pharmaceutical manufacturing company headquartered in HITEC City, Hyderabad, India. The company manufactures generic pharmaceuticals and active pharmaceutical ingredients.
 Important Vacancy details:
Post Name: production / packing
Education: Diploma 
Experienced:Freshers
Location: Hyderabad India.
Contact:Joshi A.A-+919491795337
Note:If interested candidates can share your resume to mentioned mail ID Below.
hr.atdc@aurobindo.com
  Job Description: We have requirement for the post of production / packing in Aurobindo Pharma !

Greetings from Aurobindo.!

Currently vacancies available for production / packing in AUROBINDO TRAINING & DEVELOPMENT CENTER

Common join with us for a bright future.

Selection Process: The selection will be on the basis of Interview.",
"url":"https://pharmajobalert.in/urgent-requirement-at-aurobindo-pharma-hiring-diploma-for-production-packing-freshers/"
},
{
"title":"Deccan Fine Chemicals Walk In 27th Sept 2020 for Production – Chemist/ Senior Chemist", 
"desc":"Deccan Fine Chemicals (India) Pvt. Ltd Walk In September 2020. Founded in 2008, Deccan today is one of the leading fine and specialty chemical companies in India. Headquartered in Hyderabad, Deccan operates 3 major manufacturing sites in Andhra Pradesh, Gujarat and Goa and employs approximately 1200 personnel across India.
 Important Vacancy details:
Post Name: Production – Chemist/ Senior Chemist
Education: B.Sc,Diploma
Experienced:03 to 8 years
Location:Visakhapatnam
Salary : ₹ 2,00,000 – 7,00,000 P.A.
Contact:Mr. Padmanabham – 8886616447./Mr. Sandeep – 8886603270.
 Job Description: We have requirement for the post of Production – Chemist/ Senior Chemist in Deccan Fine Chemicals (India) Pvt. Ltd !
Following safety Measures and Maintain Housekeeping
Batch charging and maintenance.
Experience in doing high vacuum distillations, Normal distillations.
Products as per batch production records process operation as per SOPs
Handling different types of reactions like exothermic, pH adjustments, drying and other.
Handling of Raw Materials as per MSDS
Knowledge on DCS (Distributed Control System, PLC (Program Logistic Control) system and
Handling Equipment’s: Reactors (SSR and GLR), Centrifuges (also Bottom Discharge Centrifuge), millers, Filters (LF, CDF, MF, NF, LMF, PNF and ANFD, PAND), Driers (TD, VTD, RCVD).
Time & Venue:27 September , 9.30 AM – 5.30 PM SVL Corporate Solutions, Near Coastal Bank, Sai Ram Parlour Lane, Opposite Steel Plant Main Gate, Kurmannapalem, Visakhapatnam.
Selection Process: The selection will be on the basis of Interview.",
"url":"https://pharmajobalert.in/deccan-fine-chemicals-walk-in-27th-sept-2020-for-production-chemist-senior-chemist/"
},
{
"title":"Telephonic interview At Saurav chemicals Recruitment for Quality Control", 
"desc":"saurav chemicals limited Recruitment September 2020. Established in the early 90’s, SCL started primarily as an Intermediate manufacturer. Presently, we take pride as being one of the largest Cephalosporin and Carbapenem Intermediate manufacturer in India. With the inception of API facility in 2004, SCL offers a wide range of Active Pharmaceutical Ingredients to its customers worldwide.
 Important Vacancy details:
Post Name: Quality Control
Education:  Any Graduate
Experienced:02 to 7 years
Location: Chandigarh
Salary :₹ 3,00,000 – 4,50,000 P.A.
Openings :07
Note:If interested candidates can share your resume to mentioned mail ID Below.
naveen@sauravchemicals.com
 Job Description: We have requirement for the post of Quality Control in saurav chemicals limited !
Saurav Chemicals Ltd inviting application for the position of Officer/Sr. Officer(QC)
we can arrange telephonic interviews.(Experience in Pharma required)
Selection Process: The selection will be on the basis of Interview.",
"url":"https://pharmajobalert.in/telephonic-interview-at-saurav-chemicals-recruitment-for-quality-control/"
},
{
"title":"Sun Pharmaceutical Hiring B.pharma for Manager – sterile packaging", 
"desc":"Sun Pharmaceutical Industries Ltd Recruitment September 2020. From humble beginnings in 1983, Sun Pharma has grown to become the 5th largest generic pharmaceutical company in the world and No. 1 in India. Our passion for research has enabled us to develop over 2000 products that are sold in more than 100 countries worldwide.
 Important Vacancy details:
Post Name: Manager – sterile packaging
Education: B.pharma
Experienced:09 to 14 years
Location: Vadodara,Halol (Near Baroda Gujarat)
Salary :INR 7,00,000 – 12,00,000 PA.
 Note:If interested candidates can share your resume to mentioned mail ID Below.
nilesh.jadhav2@sunpharma.com

 Job Description: We have requirement for the post of Manager – sterile packaging in Sun Pharmaceutical Industries Ltd !
Candidate should have experience in sterile packaging includes automated packing process equipment
Capable to manage roll of shift in charge
Capable to manage packing lines in context of productivity and quality upon coordination with quality and operation team
Capable to monitor on line documentation ( like but not limited to BPR , internal observation etc.)
Selection Process: The selection will be on the basis of Interview.",
"url":"https://pharmajobalert.in/sun-pharmaceutical-hiring-b-pharma-for-manager-sterile-packaging/"
},
{
"title":"", 
"desc":"",
"url":""
}
]
