[
{

 "title":"Multiple Positions At Comed Chemicals Limited For B.Sc./M.Sc./B.Pharm/M.Pharm", 

"desc":"Comed Chemicals Limited Recruitment  for Multiple Positions .Candidates can  find their eligibility from below details .This is best opportunity for Pharma candidates to start career in Administration Dept.Please check at bottom of the this articles for source of this notification. This content to be used only for informational purpose and not responsible for the inaccuracy or deficiency of the provided information.
 Qualification : B.Sc./M.Sc./B.Pharm/M.Pharm
 Experience - 00-05 years
 Job Description:-Enterprising and competent candidates for the below mentioned post(s) are requested to approach us immediately. With proven track record of handling sales & Marketing, meeting Doctors, chemist, handling distribution & stockiest channel. Handling a team of minimum 6 people for front line and atleast 20 people for second line manager is desired. With proven track record of handling sales & Marketing, meeting Doctors, chemist, handling distribution & stockiest channel. Experience of working as Sales representatives. Freshers may also apply.
 Location : Vadodara
 Email :  hr@comedchemicals.com
 ",

 "url":"http://www.comedchemicals.com/career.aspx"

},
{

 "title":"Annora Pharma Urgent Openings for Freshers & Experience – QC / Production", 

"desc":"Annora Pharma Pvt. Ltd Recruitment May 2020 B.sc,M.sc,B.pharma,M.pharma for QC,Production @ Hyderabad . Interested candidates may Apply online for selection as detailed below.


 
Vacancy details:

Post Name:  QC,Production
Qualification: B.sc,M.sc,B.pharma,M.pharma
Experience:0-3 years
Location - Hyderabad ",

 "url":"https://pharmajobalert.in/annora-pharma-urgent-openings-for-freshers-experience-qc-production/"

},
{

 "title":"Alembic Pharma Ltd. Recruitment May 2020", 

"desc":"Vacancy details:

Post Name: QA – AMV Reviewer (general OSD)
Qualification: B. PHARMA / M. SC,M.pharm
Experience:1 -7 Years
 Job Description: Alembic Pharmaceuticals is looking for competent personnel to be an integral part of Quality Assurance team in Formulations (general OSD) plantbased at Panelav,Vadodara (Guj).


 
Must have experience in Method Validation Department as analyst or reviewer of method validation, method verification &method transfer activities.
Review of method validation and method verification Reports & Protocols.
Calibration and analysis on HPLC, GC, GC-MS, XRD, Potentiometer.
Handling of Laboratory Investigation Reports, EIA & OOT.
Monitoring of Good Laboratory Practices.
Interested candidates matching above criteria can send their resume on qualityform@alembic.co.in.
Important details: 

Location: Vadodara",

 "url":"https://www.naukri.com/job-listings-senior-executive-qa-amv-reviewer-general-osd-alembic-pharmaceuticals-limited-vadodara-baroda-4-to-8-years-290220006008?src=jobsearchDesk&sid=15889114386162492_2&xp=1&px=1"

},
{

 "title":"", 

"desc":"",

 "url":""

},
{

 "title":"", 

"desc":"",

 "url":""

},
{

 "title":"", 

"desc":"",

 "url":""

},
{

 "title":"", 

"desc":"",

 "url":""

},
 
]
